#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-00ca37bab1bd0622c]
aws_vpc.main: Refreshing state... [id=vpc-074329525c8e1e634]
aws_security_group.elb: Refreshing state... [id=sg-08d219f9986b1d704]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-073d034dd2daa7d39]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0ef63ac5ae0293dd3]
aws_security_group.allow_http: Refreshing state... [id=sg-0e3275ac520ea9cfe]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-09e672676ec221b7e]
aws_security_group.allow_ssh: Refreshing state... [id=sg-001746942a9b94c1f]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-07d6a331e65f4881b]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-04d32cc1cb94de495]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0ca0dd1d9a7bc940c]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-03056eb855b67b71b]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-0cf32b21c2bddcd68]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-07397104497a187a9]
aws_route_table.private_route_table: Refreshing state... [id=rtb-06bc7bc45cf7319be]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-039d7f439795922fe]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-05c38f211eafd0ff0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + autoscaling_group_name = (known after apply)
      + elb                    = "ELB"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.auto_scaling_group will be created
  + resource "aws_autoscaling_group" "auto_scaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "ASG"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-07d6a331e65f4881b",
          + "subnet-0ef63ac5ae0293dd3",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "App Server"
        }
    }

  # aws_launch_configuration.ec2_config will be created
  + resource "aws_launch_configuration" "ec2_config" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0d47e1b830d7dce35"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = (known after apply)
      + security_groups             = [
          + "sg-001746942a9b94c1f",
          + "sg-08d219f9986b1d704",
          + "sg-0e3275ac520ea9cfe",
        ]
      + user_data                   = "4dcc3be16dc9633d5316a58409f25972d2895ba3"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*